In [3]:
#display database tables
import sqlite3
import pandas as pd

# connect to the database
conn = sqlite3.connect("data_warehouse.db")

# list all tables
tables = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
print("Tables in database:")
display(tables)

# fetch data from the 'employees' table and display as a DataFrame
df_employees = pd.read_sql("SELECT * FROM employees;", conn)
print("Employee Table Data:")
display(df_employees)

conn.close()

Tables in database:

        name
0  employees

Employee Table Data:

   id     name  age  salary
0   1    Alice   24   50000
1   2      Bob   30   60000
2   3  Charlie   22   55000
3   4    David   35   70000
4   5      Eva   28   65000

In [1]:
#ROLAP LAYER SQLITE3

query="""
SELECT age, AVG(salary) as avg_salary
FROM df_employees
GROUP BY age

""""

rows = fetch_data(conn,query)

print("ROLAP Query Result(SQL): "),rows

SyntaxError: unterminated string literal (detected at line 8) (2191092756.py, line 8)